Revit 2027 API
Transform.Identity Property
The identity transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Transform Identity { get; }
Public Shared ReadOnly Property Identity As Transform
	Get
public:
static property Transform^ Identity {
	Transform^ get ();
}
static member Identity : Transform with get
Property Value
Transform
Remarks
 The identity transformation does not change a point or a vector that it is applied to.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace